# GetCategoryIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementMulticategoryFilter..::..GetCategoryIds Method
ElementMulticategoryFilter Class See Also
---
Gets the category ids assigned to this filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ICollection<ElementId> GetCategoryIds()
```

Visual Basic
---
```text
Public Function GetCategoryIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetCategoryIds()
```

# ### Return Value
The category ids.
# See Also
ElementMulticategoryFilter Class
Autodesk.Revit.DB Namespace